{
    "jobs": {
        "1": {
            "id": "d6400dc3-cd60-43b7-9ec4-22a7373b0ebc",
            "name": "Estágio em Engenharia de Software (Front-end)",
            "main_activities": "\nResponsável em apoiar o time de LTV na construção e manutenção das plataformas de software da Pier, majoritariamente na camada de front-end.\nTrabalhar na construção e manutenção dos softwares da Pier (app, backoffice, site) majoritariamente na camada de front-end;\nAuxiliar a equipe na elaboração de novas soluções, participando de discussões de arquitetura, etc;\nColaborar no desenvolvimento novas funcionalidades e componentes front-end, seguindo as melhores práticas de desenvolvimento;\nApoiar nos testes unitários e de integração, identificando e corrigindo bugs.\n",
            "pre_requisites": "\nEnsino superior cursando em Análise e Desenvolvimento de Sistema, Engenharia de Software, Ciência da Computação ou áreas relacionadas;\nFormação prevista entre 2026/1 e 2027/1\nConhecimento sobre boas práticas de programação;\nConhecimento básico de linguagens como Javascript.\n",
            "differentials": "\nConhecimento básico de ReactJS;\nConhecimento básico em React Native. \n"
        }
    },
    "summaries": {
        "1": {
            "id": "bccf06e3-be91-4e83-8602-d41b7f4f01ec",
            "job_id": "d6400dc3-cd60-43b7-9ec4-22a7373b0ebc",
            "content": "## Nome Completo\nAnna Chandra Felício Teixeira\n\n## Experiência\nTrabalhou como Assistente de Engenharia I, Técnica em Eletrotécnica - Projetista Júnior e Estagiária na Templária Solar Engenharia LTDA, onde elaborou projetos para usinas de energia solar, realizou gestão do processo de instalação de sistemas, analisou o funcionamento de usinas fotovoltaicas e auxiliou na elaboração e dimensionamento de projetos.\n\n## Habilidades \nLógica de Programação, HTML, CSS, JavaScript, C, C++, C#, Python, desenvolvimento de aplicações robustas e modernas, conhecimento em tecnologias básicas da Web: HTML5 e CSS3, e experiência com .NET e DDD (Domain Drive Design).\n\n## Educação \nBacharelado em Engenharia de Software na Pontifícia Universidade Católica de Minas Gerais - PUC Minas, Ensino Médio Integrado - Técnico em Eletrotécnica no Centro Federal de Educação Tecnológica de Minas Gerais - CEFET MG, e participou de cursos como Meta - Introduction to Front-End Development, Rocketseat - NLW Unite - C# e DIO - Decola Tech | Avanade.\n\n## Idiomas \nInglês avançado",
            "opinion": "# **Análise Crítica do Currículo em Relação à Vaga de Estágio em Engenharia de Software (Front-end)**\n\n## **Pontos de Alinhamento**\n\nO currículo apresentado por Anna Chandra Felício Teixeira demonstra várias habilidades e experiências que estão alinhadas com os requisitos da vaga de Estágio em Engenharia de Software (Front-end). Aqui estão alguns pontos de destaque:\n\n*   **Conhecimento em Linguagens de Programação:** O candidato possui conhecimento em linguagens como HTML, CSS, JavaScript, C# e Python, o que é fundamental para o desenvolvimento de aplicações front-end.\n*   **Experiência em Desenvolvimento Front-end:** A participação no curso \"Introduction to Front-End Development\" oferecido pela Meta e o desenvolvimento de uma aplicação Back-End em C# com .NET demonstram a capacidade do candidato em desenvolver aplicações de front-end.\n*   **Conhecimento em Boas Práticas de Programação:** A formação em Engenharia de Software e a participação em cursos de desenvolvimento de software indicam que o candidato tem conhecimento sobre boas práticas de programação.\n\n## **Pontos de Desalinhamento**\n\nEmbora o currículo apresente várias habilidades e experiências relevantes, há alguns pontos que não atendem aos requisitos da vaga:\n\n*   **Falta de Experiência em ReactJS e React Native:** A vaga requer conhecimento básico de ReactJS e React Native, mas o currículo não apresenta experiência específica nesses frameworks.\n*   **Foco em Desenvolvimento Back-end:** Embora o candidato tenha experiência em desenvolvimento front-end, a maioria de suas experiências e habilidades estão focadas em desenvolvimento back-end, o que pode ser um desafio para a vaga de front-end.\n\n## **Pontos de Atenção**\n\nAlguns pontos do currículo merecem atenção especial:\n\n*   **Frequência de Mudanças de Emprego:** O candidato mudou de emprego várias vezes nos últimos anos, o que pode indicar falta de estabilidade ou satisfação no trabalho.\n*   **Lacunas no Histórico de Trabalho:** Não há informações sobre o que o candidato fez entre os períodos de emprego, o que pode ser um indicador de falta de produtividade ou motivação.\n*   **Características Pessoais:** O candidato apresenta uma personalidade proativa e motivada, o que é fundamental para o sucesso na vaga de estágio em Engenharia de Software (Front-end).\n\nEm resumo, o currículo de Anna Chandra Felício Teixeira apresenta várias habilidades e experiências relevantes para a vaga de Estágio em Engenharia de Software (Front-end), mas também há alguns pontos que precisam ser melhorados, como a falta de experiência em ReactJS e React Native. Com uma abordagem de desenvolvimento contínuo e um foco em melhorar as habilidades em desenvolvimento front-end, o candidato pode se tornar um excelente profissional na área de Engenharia de Software.",
            "file": "Trilha - Inteligencia Artificial/Projeto - Analisador de Curriculos com IA/resumes\\Anna Chandra Felício Teixeira.pdf"
        },
        "2": {
            "id": "56f34973-6190-489c-ad2b-cda01baf8fe5",
            "job_id": "d6400dc3-cd60-43b7-9ec4-22a7373b0ebc",
            "content": "## Nome Completo\nGabriel Victor Pires dos Santos\n\n## Experiência\nAuxiliar Administrativo, com experiência em atendimento ao cliente, emissão de notas fiscais, controle de contas a pagar e a receber, gerenciamento de compras junto a fornecedores e manutenção de computadores. Desenvolvedor de aplicações com experiência em ReactJS, desenvolvimento de uma aplicação de gestão de participantes para eventos presenciais e criação de um site desktop para montar planos de viagem com amigos.\n\n## Habilidades \nHTML, CSS, JavaScript, React, NextJs, TypeScript, TailwindCSS, Java, Spring Boot, PostgreSQL, MySQL, Git, GitHub, Maven, API Rest, HSQL Database, JPA, Flyway, DTOs, Ruby on Rails.\n\n## Educação \nUNIAMÉRICA - Centro Universitário União das Américas, curso de Análise e Desenvolvimento de Sistemas, com certificados em OBJECT-ORIENTED DEVELOPER, Programmer e BASIC FRONTEND pela Descomplica Faculdade Digital. Participação em cursos da Rocketseat, incluindo NLW Journey e NLW Unite, e curso de Introdução ao Git e ao GitHub da DIO.\n\n## Idiomas \nInglês Intermediário",
            "opinion": "# **ANÁLISE CRÍTICA DO CURRÍCULO**\n## **INTRODUÇÃO**\nO currículo fornecido para a vaga de Estágio em Engenharia de Software (Front-end) apresenta uma combinação de habilidades técnicas e experiências que serão analisadas em detalhes para determinar o nível de alinhamento com os requisitos da vaga.\n\n## **PONTOS DE ALINHAMENTO**\nOs seguintes pontos destacam as áreas onde o currículo do candidato está alinhado com os requisitos da vaga:\n- **Conhecimento em Linguagens de Programação**: O candidato apresenta conhecimento em HTML, CSS, JavaScript, React e NextJs, que são fundamentais para o desenvolvimento de aplicações front-end.\n- **Experiência em Desenvolvimento de Aplicações**: A participação em projetos como o NLW Journey da Rocketseat, onde o candidato desenvolveu uma aplicação chamada Plann.er utilizando React, TypeScript e TailwindCSS, demonstra habilidades práticas em desenvolvimento de aplicações front-end.\n- **Conhecimento em Bancos de Dados**: Embora a vaga não especifique explicitamente a necessidade de conhecimento em bancos de dados, o candidato apresenta experiência com PostgreSQL e MySQL, o que pode ser útil em projetos que integram back-end e front-end.\n\n## **PONTOS DE DESALINHAMENTO**\nAs seguintes áreas apresentam desalinhamento entre o currículo do candidato e os requisitos da vaga:\n- **Falta de Experiência em React Native**: Embora o candidato tenha experiência em React, a vaga menciona conhecimento básico em React Native como um diferencial, o que não está explicitamente mencionado no currículo.\n- **Nível de Conhecimento em Boas Práticas de Programação**: A vaga destaca a importância do conhecimento sobre boas práticas de programação, mas o currículo não fornece detalhes específicos sobre a aplicação dessas práticas nos projetos desenvolvidos.\n\n## **PONTOS DE ATENÇÃO**\nOs seguintes pontos merecem atenção especial:\n- **Diversidade de Tecnologias**: O candidato apresenta uma ampla gama de tecnologias e linguagens de programação, o que pode ser um ponto positivo em termos de adaptabilidade, mas também pode indicar uma falta de especialização em áreas específicas.\n- **Experiência em Ambientes Acadêmicos e Profissionais**: A combinação de experiências acadêmicas (como a participação em cursos e projetos) e profissionais (como o trabalho como auxiliar administrativo) pode ser benéfica, oferecendo uma visão ampla das necessidades de diferentes ambientes.\n\n## **CONCLUSÃO**\nO currículo do candidato apresenta pontos fortes em termos de habilidades técnicas e experiências relevantes para a vaga de Estágio em Engenharia de Software (Front-end). No entanto, áreas como a falta de experiência em React Native e a necessidade de mais detalhes sobre a aplicação de boas práticas de programação merecem atenção. Com uma abordagem de desenvolvimento contínuo e um foco em aprimorar as habilidades específicas requeridas pela vaga, o candidato tem potencial para se tornar um membro valioso da equipe de LTV na Pier.",
            "file": "Trilha - Inteligencia Artificial/Projeto - Analisador de Curriculos com IA/resumes\\Gabriel Victor.pdf"
        }
    },
    "analysis": {
        "1": {
            "id": "6ee91a8e-deb8-4726-b53e-1867bf880123",
            "job_id": "d6400dc3-cd60-43b7-9ec4-22a7373b0ebc",
            "summary_id": "bccf06e3-be91-4e83-8602-d41b7f4f01ec",
            "name": "Anna Chandra Felício Teixeira",
            "skills": [
                "Lógica de Programação, HTML, CSS, JavaScript, C, C++, C#, Python, desenvolvimento de aplicações robustas e modernas, conhecimento em tecnologias básicas da Web: HTML5 e CSS3, e experiência com .NET e DDD (Domain Drive Design)."
            ],
            "education": [
                "Bacharelado em Engenharia de Software na Pontifícia Universidade Católica de Minas Gerais  PUC Minas, Ensino Médio Integrado  Técnico em Eletrotécnica no Centro Federal de Educação Tecnológica de Minas Gerais  CEFET MG, e participou de cursos como Meta  Introduction to FrontEnd Development, Rocketseat  NLW Unite  C# e DIO  Decola Tech | Avanade."
            ],
            "languages": [
                "Inglês avançado"
            ],
            "score": 5.075
        },
        "2": {
            "id": "d342cdec-d222-4c0e-bb06-b7e997f7ff49",
            "job_id": "d6400dc3-cd60-43b7-9ec4-22a7373b0ebc",
            "summary_id": "56f34973-6190-489c-ad2b-cda01baf8fe5",
            "name": "Gabriel Victor Pires dos Santos",
            "skills": [
                "HTML, CSS, JavaScript, React, NextJs, TypeScript, TailwindCSS, Java, Spring Boot, PostgreSQL, MySQL, Git, GitHub, Maven, API Rest, HSQL Database, JPA, Flyway, DTOs, Ruby on Rails."
            ],
            "education": [
                "UNIAMÉRICA  Centro Universitário União das Américas, curso de Análise e Desenvolvimento de Sistemas, com certificados em OBJECTORIENTED DEVELOPER, Programmer e BASIC FRONTEND pela Descomplica Faculdade Digital. Participação em cursos da Rocketseat, incluindo NLW Journey e NLW Unite, e curso de Introdução ao Git e ao GitHub da DIO."
            ],
            "languages": [
                "Inglês Intermediário"
            ],
            "score": 6.95
        }
    },
    "files": {
        "1": {
            "file_id": "fddd6ee0-eead-4c4a-8f60-0b402134577e",
            "job_id": "d6400dc3-cd60-43b7-9ec4-22a7373b0ebc"
        },
        "2": {
            "file_id": "d87be25e-4eb7-403c-80c6-a7d7b555109a",
            "job_id": "d6400dc3-cd60-43b7-9ec4-22a7373b0ebc"
        }
    }
}