{
    "jobs": {
        "1": {
            "id": "d6400dc3-cd60-43b7-9ec4-22a7373b0ebc",
            "name": "Estágio em Engenharia de Software (Front-end)",
            "main_activities": "\nResponsável em apoiar o time de LTV na construção e manutenção das plataformas de software da Pier, majoritariamente na camada de front-end.\nTrabalhar na construção e manutenção dos softwares da Pier (app, backoffice, site) majoritariamente na camada de front-end;\nAuxiliar a equipe na elaboração de novas soluções, participando de discussões de arquitetura, etc;\nColaborar no desenvolvimento novas funcionalidades e componentes front-end, seguindo as melhores práticas de desenvolvimento;\nApoiar nos testes unitários e de integração, identificando e corrigindo bugs.\n",
            "pre_requisites": "\nEnsino superior cursando em Análise e Desenvolvimento de Sistema, Engenharia de Software, Ciência da Computação ou áreas relacionadas;\nFormação prevista entre 2026/1 e 2027/1\nConhecimento sobre boas práticas de programação;\nConhecimento básico de linguagens como Javascript.\n",
            "differentials": "\nConhecimento básico de ReactJS;\nConhecimento básico em React Native. \n"
        }
    },
    "summaries": {
        "1": {
            "id": "a519c85f-384c-4a47-bc96-493817e5092c",
            "job_id": "d6400dc3-cd60-43b7-9ec4-22a7373b0ebc",
            "content": "## Nome Completo\nAnna Chandra Felício Teixeira\n\n## Experiência\nTemplária Solar Engenharia LTDA - Assistente de Engenharia I (Jul 2024 - Atual), Templária Solar Engenharia LTDA - Técnica em Eletrotécnica - Projetista Júnior (Nov 2023 - Jun 2024), Templária Solar Engenharia LTDA - Estagiária (Dez 2022 - Nov 2023)\n\n## Habilidades \nLógica de Programação, HTML, CSS, JavaScript, C, C++, C#, Python\n\n## Educação \nBacharelado - Engenharia de Software (Ago 2024 - Dez 2028), Ensino Médio Integrado - Técnico em Eletrotécnica (Jan 2020 - Dez 2022), Pontifícia Universidade Católica de Minas Gerais - PUC Minas, Centro Federal de Educação Tecnológica de Minas Gerais - CEFET MG\n\n## Idiomas \nInglês avançado",
            "opinion": "# **ANÁLISE CRÍTICA DO CURRÍCULO**\n## **INTRODUÇÃO**\nO presente relatório tem como objetivo realizar uma análise crítica do currículo do candidato em relação à descrição da vaga de Estágio em Engenharia de Software (Front-end). O objetivo é identificar os pontos de alinhamento, desalinhamento e atenção do currículo em relação aos requisitos da vaga.\n\n## **PONTOS DE ALINHAMENTO**\nO currículo do candidato apresenta alguns pontos de alinhamento com os requisitos da vaga, incluindo:\n* Conhecimento em linguagens de programação relevantes, como HTML, CSS, JavaScript e Python.\n* Experiência em desenvolvimento de aplicações, como a participação no curso de introdução ao Desenvolvimento Front-End oferecido pela Meta.\n* Conhecimento básico de linguagens como JavaScript, que é um requisito da vaga.\n* Ensino superior em andamento em Engenharia de Software, que atende ao requisito de ensino superior cursando em áreas relacionadas.\n\n## **PONTOS DE DESALINHAMENTO**\nNo entanto, o currículo do candidato também apresenta alguns pontos de desalinhamento com os requisitos da vaga, incluindo:\n* Falta de experiência específica em front-end, que é o foco da vaga.\n* Ausência de menção a conhecimento em ReactJS ou React Native, que são diferenciais da vaga.\n* A formação prevista do candidato (2024-2028) não se encaixa exatamente no período previsto pela vaga (2026/1 e 2027/1).\n\n## **PONTOS DE ATENÇÃO**\nAlém disso, o currículo do candidato apresenta alguns pontos que merecem atenção especial, incluindo:\n* A frequência com que o candidato troca de emprego ou função, o que pode indicar uma falta de estabilidade ou comprometimento.\n* A presença de lacunas no histórico de trabalho, o que pode ser um indicador de falta de experiência ou habilidades.\n* A menção a características pessoais, como a capacidade de trabalhar em equipe e a proatividade, que podem ser importantes para o desempenho no cargo.\n\n## **CONCLUSÃO**\nEm resumo, o currículo do candidato apresenta alguns pontos positivos, como o conhecimento em linguagens de programação relevantes e a experiência em desenvolvimento de aplicações. No entanto, também apresenta alguns pontos negativos, como a falta de experiência específica em front-end e a ausência de menção a conhecimento em ReactJS ou React Native. Além disso, o currículo apresenta alguns pontos que merecem atenção especial, como a frequência com que o candidato troca de emprego ou função e a presença de lacunas no histórico de trabalho. Em geral, o currículo do candidato não atende completamente aos requisitos da vaga, mas apresenta alguns pontos positivos que podem ser considerados.\n\n## **RECOMENDAÇÕES**\nCom base na análise crítica do currículo, recomendamos que o candidato:\n* Desenvolva experiência específica em front-end, seja através de cursos, projetos pessoais ou experiência profissional.\n* Aprenda e mencione conhecimento em ReactJS ou React Native, que são diferenciais da vaga.\n* Verifique se a formação prevista se encaixa exatamente no período previsto pela vaga.\n* Destaque as características pessoais e habilidades que podem ser importantes para o desempenho no cargo.\n\n## **AVALIAÇÃO FINAL**\nA avaliação final do currículo do candidato é de 6,5 em 10. O candidato apresenta alguns pontos positivos, mas também apresenta alguns pontos negativos e lacunas que precisam ser preenchidas. Com desenvolvimento e experiência adicionais, o candidato pode se tornar um forte candidato para a vaga de Estágio em Engenharia de Software (Front-end).",
            "file": "Trilha - Inteligencia Artificial/Projeto - Analisador de Curriculos com IA/resumes\\Anna Chandra.pdf"
        },
        "2": {
            "id": "daa4e40e-e84b-4da4-bc81-a3bd6744800e",
            "job_id": "d6400dc3-cd60-43b7-9ec4-22a7373b0ebc",
            "content": "## Nome Completo\nJonathan Rubens Dutra Pereira\n\n## Experiência\nDesenvolvimento Web com domínio em HTML5, CSS3 e JavaScript para criação de interfaces de usuário responsivas e interativas. Fortes habilidades em lógica de programação, com foco na resolução de problemas e desenvolvimento de algoritmos eficientes. Conhecimento prático em várias linguagens de programação, incluindo C#, C++, Kotlin, Java, Python e NodeJs. Experiência com SQL para manipulação de dados e consultas em bancos de dados relacionais. Uso do Pacote Office (Excel, Word, PowerPoint) para organização e apresentação de dados. Conhecimento em Figma para design de interfaces e prototipação de aplicações.\n\n## Habilidades \nConhecimento forte em HTML5, CSS3, JavaScript, Lógica de Programação e Pacote Office. Conhecimento básico em C#, C++, Kotlin, Java, Python, NodeJs, SQL e Figma. Em aprendizado: Desenvolvimento de aplicações web avançadas, Integração de APIs, Frameworks JavaScript (React, Angular, Vue) e Robótica e automação.\n\n## Educação \nCursando ensino médio técnico de Desenvolvimento de Sistemas na ETSSA, com conclusão prevista para 12/2024. Participação em cursos e eventos adicionais, como Pacote Office Avançado, Elaboração de material para Linguagem de Marcação HTML, Elaboração de material para Linguagem de Estilização CSS, Fundamentos da Programação web, Lógica de Programação e Robótica Educação e Eventos.\n\n## Idiomas \nPortuguês - Nativo, Inglês - Intermediário",
            "opinion": "# **Análise Crítica do Currículo em Relação à Vaga de Estágio em Engenharia de Software (Front-end)**\n\n## **Introdução**\nO objetivo desta análise é avaliar a compatibilidade do currículo do candidato, Jonathan Rubens Dutra Pereira, com os requisitos e expectativas da vaga de Estágio em Engenharia de Software (Front-end) na Pier. Esta avaliação busca identificar os pontos de alinhamento, desalinhamento e atenção especial que o currículo apresenta em relação à descrição da vaga.\n\n## **Pontos de Alinhamento**\nOs seguintes aspectos do currículo de Jonathan Rubens Dutra Pereira estão alinhados com os requisitos da vaga:\n\n* **Conhecimento em Front-end**: O candidato demonstra domínio em tecnologias de front-end, incluindo HTML5, CSS3 e JavaScript, que são fundamentais para a vaga.\n* **Lógica de Programação**: A forte habilidade em lógica de programação é um requisito importante para o desenvolvimento de software, especialmente em front-end.\n* **Ferramentas e Tecnologias**: A experiência com o Pacote Office e conhecimento em Figma são habilidades adicionais que podem ser úteis no contexto da vaga.\n* **Desejo de Aprendizado**: A menção a estar em aprendizado de desenvolvimento de aplicações web avançadas, integração de APIs e frameworks JavaScript (React, Angular, Vue) demonstra um desejo de se desenvolver profissionalmente, alinhado com as necessidades da vaga.\n\n## **Pontos de Desalinhamento**\nOs seguintes aspectos do currículo apresentam desalinhamento com os requisitos da vaga:\n\n* **Nível de Formação Acadêmica**: A vaga exige ensino superior cursando em Análise e Desenvolvimento de Sistema, Engenharia de Software, Ciência da Computação ou áreas relacionadas, enquanto o candidato está cursando ensino médio técnico de Desenvolvimento de Sistemas.\n* **Conhecimento Básico de ReactJS e React Native**: Embora o candidato tenha conhecimento em JavaScript, não há menção específica a conhecimento básico em ReactJS ou React Native, que são diferenciais importantes para a vaga.\n* **Experiência Prática**: A vaga parece exigir uma experiência prática mais consolidada em desenvolvimento de software, especialmente em front-end, que não é claramente demonstrada no currículo do candidato.\n\n## **Pontos de Atenção**\nOs seguintes aspectos do currículo merecem atenção especial:\n\n* **Frequência de Cursos e Experiências Adicionais**: O candidato participou de vários cursos e experiências adicionais, o que demonstra proatividade e desejo de se desenvolver. No entanto, é importante avaliar a profundidade e a relevância dessas experiências para a vaga.\n* **Robótica e Automação**: Embora não seja diretamente relacionado à vaga, a participação em eventos de robótica e automação pode indicar habilidades em resolução de problemas e desenvolvimento de projetos, que são valiosas em qualquer área de desenvolvimento de software.\n* **Idiomas**: O candidato tem inglês intermediário, o que pode ser uma limitação em um ambiente de trabalho que exige comunicação eficaz em inglês, especialmente em equipes globais ou em projetos que envolvam tecnologias e documentações em inglês.\n\n## **Conclusão**\nEm resumo, o currículo de Jonathan Rubens Dutra Pereira apresenta alguns pontos de alinhamento com os requisitos da vaga, especialmente em termos de habilidades técnicas em front-end. No entanto, há desalinhamentos significativos, como o nível de formação acadêmica e a falta de experiência prática mais consolidada. Além disso, pontos de atenção especial, como a frequência de cursos adicionais e a participação em eventos de robótica, podem ser vistos como positivos, mas requerem uma avaliação mais aprofundada. É importante realizar uma entrevista ou avaliação prática para melhor entender as habilidades e o potencial do candidato para a vaga.",
            "file": "Trilha - Inteligencia Artificial/Projeto - Analisador de Curriculos com IA/resumes\\Jonathan Rubens Dutra Pereira.pdf"
        },
        "3": {
            "id": "9bde0f0c-dc75-4fae-b54c-b2c61373688c",
            "job_id": "d6400dc3-cd60-43b7-9ec4-22a7373b0ebc",
            "content": "## Nome Completo\nVITOR SCHMIDT RIBEIRO\n\n## Experiência\nAuxiliar de Escritório em Geral na Master Distribuidora de Peças para Caminhões de fev/2024 a out/2024, responsável por produção de conteúdo audiovisual para rede social. Assistente Administrativo na TS Sports de ago/2023 a dez/2023, responsável por gestão das plataformas de E-commerce.\n\n## Habilidades \nConhecimento forte em Lógica de Programação. Conhecimento básico em C#, JavaScript, HTML5, CSS3, Bootstrap, UML e Scrum. Em aprendizado: Java, Programação Orientada a Objetos e MySQL.\n\n## Educação \nEstudante de Tecnologia em Análise e Desenvolvimento de Sistemas na PUC MINAS, 2º semestre, com previsão de conclusão em 06/2026. Cursos adicionais incluem Java e Programação Orientada a Objetos (Udemy) e Lógica de Programação (Curso em Vídeo).\n\n## Idiomas \nInglês - Em aprendizado, Português - Nativo",
            "opinion": "**ANÁLISE CRÍTICA DO CURRÍCULO**\n=====================================\n\n**INTRODUÇÃO**\n---------------\n\nO objetivo desta análise é avaliar o currículo do candidato Vitor Schmidt Ribeiro em relação à vaga de Estágio em Engenharia de Software (Front-end) e fornecer uma opinião crítica e detalhada sobre os pontos de alinhamento, desalinhamento e atenção.\n\n**PONTOS DE ALINHAMENTO**\n-------------------------\n\n* O candidato está cursando Tecnologia em Análise e Desenvolvimento de Sistemas, o que está alinhado com os requisitos da vaga.\n* O candidato tem conhecimento básico em linguagens como JavaScript, HTML5, CSS3 e Bootstrap, o que é relevante para a vaga de front-end.\n* O candidato tem experiência em produção de conteúdo audiovisual e gestão de plataformas de E-commerce, o que pode ser útil para a vaga.\n\n**PONTOS DE DESALINHAMENTO**\n---------------------------\n\n* O candidato não tem experiência específica em front-end, apesar de ter conhecimento básico em linguagens relevantes.\n* O candidato não tem conhecimento de ReactJS ou React Native, o que é considerado um diferencial para a vaga.\n* O candidato está no 2º semestre do curso, o que pode ser considerado um pouco cedo para um estágio em engenharia de software.\n* O candidato não tem experiência em testes unitários e de integração, o que é uma habilidade importante para a vaga.\n\n**PONTOS DE ATENÇÃO**\n---------------------\n\n* O candidato tem uma frequência de troca de emprego relativamente alta, o que pode ser um sinal de instabilidade ou falta de comprometimento.\n* O candidato não tem experiência em trabalhar em equipe, o que é importante para a vaga.\n* O candidato tem um perfil de LinkedIn e GitHub, o que é positivo para a vaga.\n* O candidato está em aprendizado de Java e Programação Orientada a Objetos, o que pode ser útil para a vaga.\n\n**CONCLUSÃO**\n--------------\n\nEm resumo, o candidato Vitor Schmidt Ribeiro tem alguns pontos de alinhamento com a vaga de Estágio em Engenharia de Software (Front-end), mas também tem alguns pontos de desalinhamento e atenção. É importante notar que o candidato está no início de sua carreira e pode ter potencial para aprender e crescer. No entanto, é fundamental que o candidato demonstre sua capacidade de aprender e se adaptar às necessidades da vaga.\n\n**RECOMENDAÇÕES**\n------------------\n\n* Realizar uma entrevista com o candidato para avaliar sua capacidade de aprender e se adaptar às necessidades da vaga.\n* Avaliar a experiência do candidato em produção de conteúdo audiovisual e gestão de plataformas de E-commerce e como isso pode ser aplicado à vaga.\n* Fornecer feedback ao candidato sobre os pontos de desalinhamento e atenção e como ele pode melhorar suas habilidades e experiência para se tornar um candidato mais forte para a vaga.\n\n**RANKING DO CANDIDATO**\n-------------------------\n\nCom base na análise crítica do currículo, eu daria ao candidato Vitor Schmidt Ribeiro um ranking de 6/10. O candidato tem alguns pontos de alinhamento com a vaga, mas também tem alguns pontos de desalinhamento e atenção. É importante notar que o candidato está no início de sua carreira e pode ter potencial para aprender e crescer. No entanto, é fundamental que o candidato demonstre sua capacidade de aprender e se adaptar às necessidades da vaga.",
            "file": "Trilha - Inteligencia Artificial/Projeto - Analisador de Curriculos com IA/resumes\\Vitor Schmidt Ribeiro.pdf"
        }
    },
    "analysis": {
        "1": {
            "id": "862b4e3d-e701-475f-9417-2357d47bf00b",
            "job_id": "d6400dc3-cd60-43b7-9ec4-22a7373b0ebc",
            "summary_id": "a519c85f-384c-4a47-bc96-493817e5092c",
            "name": "Anna Chandra Felício Teixeira",
            "skills": [
                "Lógica de Programação, HTML, CSS, JavaScript, C, C++, C#, Python"
            ],
            "education": [
                "Bacharelado  Engenharia de Software (Ago 2024  Dez 2028), Ensino Médio Integrado  Técnico em Eletrotécnica (Jan 2020  Dez 2022), Pontifícia Universidade Católica de Minas Gerais  PUC Minas, Centro Federal de Educação Tecnológica de Minas Gerais  CEFET MG"
            ],
            "languages": [
                "Inglês avançado"
            ],
            "score": 5.3
        },
        "2": {
            "id": "126c2d3c-9810-4b6f-9227-d61f5411ffa4",
            "job_id": "d6400dc3-cd60-43b7-9ec4-22a7373b0ebc",
            "summary_id": "daa4e40e-e84b-4da4-bc81-a3bd6744800e",
            "name": "Jonathan Rubens Dutra Pereira",
            "skills": [
                "Conhecimento forte em HTML5, CSS3, JavaScript, Lógica de Programação e Pacote Office. Conhecimento básico em C#, C++, Kotlin, Java, Python, NodeJs, SQL e Figma. Em aprendizado: Desenvolvimento de aplicações web avançadas, Integração de APIs, Frameworks JavaScript (React, Angular, Vue) e Robótica e automação."
            ],
            "education": [
                "Cursando ensino médio técnico de Desenvolvimento de Sistemas na ETSSA, com conclusão prevista para 12/2024. Participação em cursos e eventos adicionais, como Pacote Office Avançado, Elaboração de material para Linguagem de Marcação HTML, Elaboração de material para Linguagem de Estilização CSS, Fundamentos da Programação web, Lógica de Programação e Robótica Educação e Eventos."
            ],
            "languages": [
                "Português  Nativo, Inglês  Intermediário"
            ],
            "score": 5.0
        },
        "3": {
            "id": "a141b3c3-49b5-4e51-bef3-6f3fb8dc4c63",
            "job_id": "d6400dc3-cd60-43b7-9ec4-22a7373b0ebc",
            "summary_id": "9bde0f0c-dc75-4fae-b54c-b2c61373688c",
            "name": "VITOR SCHMIDT RIBEIRO",
            "skills": [
                "Conhecimento forte em Lógica de Programação. Conhecimento básico em C#, JavaScript, HTML5, CSS3, Bootstrap, UML e Scrum. Em aprendizado: Java, Programação Orientada a Objetos e MySQL."
            ],
            "education": [
                "Estudante de Tecnologia em Análise e Desenvolvimento de Sistemas na PUC MINAS, 2º semestre, com previsão de conclusão em 06/2026. Cursos adicionais incluem Java e Programação Orientada a Objetos (Udemy) e Lógica de Programação (Curso em Vídeo)."
            ],
            "languages": [
                "Inglês  Em aprendizado, Português  Nativo"
            ],
            "score": 5.8
        }
    },
    "files": {
        "1": {
            "file_id": "d52bc381-d0a2-4438-9f74-205414988f81",
            "job_id": "d6400dc3-cd60-43b7-9ec4-22a7373b0ebc"
        },
        "2": {
            "file_id": "7c14f2ab-874b-4ee1-a22d-a76f3f3d0c64",
            "job_id": "d6400dc3-cd60-43b7-9ec4-22a7373b0ebc"
        },
        "3": {
            "file_id": "f9c37cc3-432d-4849-b592-4132930296ea",
            "job_id": "d6400dc3-cd60-43b7-9ec4-22a7373b0ebc"
        }
    }
}